<?php
/*
abs — Модуль числа
acos — Арккосинус
acosh — Гиперболический арккосинус
asin — Арксинус
asinh — Гиперболический арксинус
atan2 — Арктангенс двух переменных
atan — Арктангенс
atanh — Гиперболический арктангенс
base_convert — Преобразование числа между произвольными системами счисления
bindec — Двоичное в десятичное
ceil — Округляет дробь в большую сторону
cos — Косинус
cosh — Гиперболический косинус
decbin — Переводит число из десятичной системы счисления в двоичную
dechex — Переводит число из десятичной системы счисления в шестнадцатеричную
decoct — Переводит число из десятичной системы счисления в восьмеричную
deg2rad — Преобразует значение из градусов в радианы
exp — Вычисляет число e в степени
expm1 — Возвращает exp(number) - 1, рассчитанное таким образом, что результат точен, даже если number близок к нулю.
floor — Округляет дробь в меньшую сторону
fmod — Возвращает дробный остаток от деления по модулю
getrandmax — Возвращает максимально возможное случайное число
hexdec — Переводит число из шестнадцатеричной системы счисления в десятичную
hypot — Рассчитывает длину гипотенузы прямоугольного треугольника
intdiv — Целочисленное деление
is_finite — Проверяет, является ли значение допустимым конечным числом
is_infinite — Проверяет, является ли значение бесконечным
is_nan — Проверяет, является ли значение "не числом"
lcg_value — Комбинированный линейно конгруэнтный генератор
log10 — Десятичный логарифм
log1p — Возвращает log(1 + number), рассчитанный таким, что результат точен, даже если значение number близко к нулю
log — Натуральный логарифм
max — Возвращает наибольшее значение
min — Находит наименьшее значение
mt_getrandmax — Показывает максимально возможное значение случайного числа
mt_rand — Генерирует случайное значение методом mt
mt_srand — Переинициализирует генератор случайных чисел mt
octdec — Переводит число из восьмеричной системы счисления в десятичную
pi — Возвращает число Пи
pow — Возведение в степень
rad2deg — Преобразует значение из радианов в градусы
rand — Генерирует случайное число
round — Округляет число типа float
sin — Синус
sinh — Гиперболический синус
sqrt — Квадратный корень
srand — Изменяет начальное число генератора псевдослучайных чисел
tan — Тангенс
tanh — Гиперболический тангенс
*/
?>